trebisky/stm32f103/usb_papoon2/papoon/usb_dev.h
// papoon_usb: "Not Insane" USB library for STM32F103xx MCUs
// Copyright (C) 2019,2020 Mark R. Rubin
//
// This file is part of papoon_usb.
//
// The papoon_usb program is free software: you can redistribute it
// and/or modify it under the terms of the GNU General Public License
// as published by the Free Software Foundation, either version 3 of
// the License, or (at your option) any later version.
//
// The papoon_usb program is distributed in the hope that it will be
// useful, but WITHOUT ANY WARRANTY; without even the implied warranty
// of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.	See the GNU
// General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// (LICENSE.txt) along with the papoon_usb program.  If not, see
// <https://www.gnu.org/licenses/gpl.html>


#ifndef USB_DEV_HXX
#define USB_DEV_HXX

#define USB_DEV_MAJOR_VERSION   1
#define USB_DEV_MINOR_VERSION   2
#define USB_DEV_MICRO_VERSION   1

#include <stm32f103xb.h>

#if STM32F103XB_MAJOR_VERSION == 1
#if STM32F103XB_MINOR_VERSION  < 2
#warning STM32F103XB_MINOR_VERSION >= 2 with required STM32F103XB_MAJOR_VERSION == 1
#endif
#else
#error STM32F103XB_MAJOR_VERSION != 1
#endif



namespace stm32f10_12357_xx {

class UsbDev {
  public:

    // client application code optinally uses device_state() accessor to
    // test if "CONFIGURED", indicating that USB device has been fully
    // enumerated by host and peripheral is ready to send and receive data
    enum class DeviceState {
        CONSTRUCTED = 0,
        INITIALIZED    ,
        RESET          ,
        ADDRESSED      ,
        CONFIGURED
    };

    // As defined by USB standards.
    // Must be public for use in derived class static descriptors.
    enum class DescriptorType {
        DEVICE        = 0x1,
        CONFIGURATION = 0x2,
        STRING        = 0x3,
        INTERFACE     = 0x4,
        ENDPOINT      = 0x5,
    };

    // As defined by USB standards.
    // Must be public for use in derived class static descriptors.
    enum class Descriptor {
        DEVICE           = 1,
        CONFIGURATION    = 2,
        STRING           = 3,
        INTERFACE        = 4,
        ENDPOINT         = 5,
        DEVICE_QUALIFIER = 6,
        OTHER_SPEED      = 7,
        INTERFACE_POWER  = 8,
        OTG              = 9,
    };

    // As defined by USB standards.
    // Must be public for use in derived class static descriptors.
    enum class EndpointType {
        CONTROL      = 0,
        ISYNCHRONOUS = 1,
        BULK         = 2,
        INTERRUPT    = 3,
    };

    // USB standard: offset into configuration descriptor to length field
    static const uint8_t    CONFIG_DESC_SIZE_NDX = 2;

    // USB standard: Bit in endpoint descriptor address byte. If set, endpoint
    //   is IN; if clear is OUT (host-centric nomenclature)
    // Endpoint numbers aka addresses limited to 4 bits. Other bits reserverd,
    //   should be set to zero
    static const uint8_t    ENDPOINT_DIR_IN      = 0x80,
                            ENDPOINT_ADDR_MASK   = 0x0F;



    constexpr
    UsbDev()
    :   _endpoints            {                         },
#ifdef USB_DEV_ENDPOINT_CALLBACKS
        _recv_callbacks       {{0, 0}                   },
        _send_callbacks       {{0, 0}                   },
#endif
        _epaddr2eprn          {0                        },
        _eprn2epaddr          {0                        },
        _send_info            (                         ),
        _recv_info            (                         ),
        _setup_packet         (0                        ),
        _device_state         (DeviceState ::CONSTRUCTED),
    //  _status               (0                        ),
        _recv_readys          (0x0000                   ),
        _send_readys          (0x0000                   ),
        _send_readys_pending  (0x0000                   ),
        _last_send_size       (0                        ),
        _num_eprns            (1                        ), // parse descriptor,
                                                           // always endpoint 0
        _current_configuration(0                        ),
        _current_interface    (0                        ),
        _pending_set_addr     (IMPOSSIBLE_DEV_ADDR      )
    {}


    // need public accessors for static initialization of _STRING_DESCS
    //
    static constexpr const uint8_t* language_id_string_desc()
    {
        return _LANGUAGE_ID_STRING_DESC;
    }
    static constexpr const uint8_t* vendor_string_desc()
    {
        return _VENDOR_STRING_DESC;
    }
    static constexpr const uint8_t* serial_number_string_desc()
    {
        return _SERIAL_NUMBER_STRING_DESC;
    }


    // Optional use by client application.
    // Will copy/format ST "Unique Device ID" value into USB descriptor,
    // Otherwise value will be  default string "000..."
    // Hardware bug: must be done while main CPU clock at default 8 MHz
    //   before mandatory increase to 48 or 72 MHz for USB peripheral.
    void    serial_number_init();

    // Not done in constexpr constructor because must be done after
    //   MCU peripheral, clock, etc. configuration/initialization.
    bool    init();

#ifdef USB_DEV_FORCE_RESET_CAPABILITY
    // Experimental
    // Not useful, doesn't reset USB bus (pull D+ line low) to indicate
    //   reset to host and cause re-enumeration
    void    force_reset();
#endif

    // see "enum class DeviceState", above
    DeviceState     device_state() const { return _device_state ; }

    void interrupt_handler();


    // STM32F10xx/UsbDev endpoint semantics allow endpoint N to be
    // bidirectional, i.e. both receive (USB standard host-centric "OUT",
    // endpoint number N in USB endpoint descriptor) and send (USB standard
    // host-centric "IN", endpoint number 0x80|N in USB endpoint descriptor)
    //

#ifndef USB_DEV_INTERRUPT_DRIVEN
    // Client application must call at high frequency  during USB enumeration
    //   process, less so afterwards
    // Returns bits set corresponding to  endpoints with received data or
    //   ready to send.
    uint32_t  poll()
    {
        if (stm32f103xb::usb->istr.any(  stm32f103xb::Usb::Istr::CTR
                                       | stm32f103xb::Usb::Istr::RESET))
            interrupt_handler();

        return (_send_readys << 16) | _recv_readys;
    }

