trebisky/stm32f103/usb_papoon2/papoon/usb_dev.h
    // convenience routine for parsing poll() return value
    static constexpr uint32_t poll_recv_ready(
    const uint8_t   endpoint)
    {
        return 1 << endpoint;
    }

    // convenience routine for parsing poll() return value
    static constexpr uint32_t poll_send_ready(
    const uint8_t   endpoint)
    {
        return 1 << (endpoint + 16);
    }
#endif


#ifdef USB_DEV_ENDPOINT_CALLBACKS
    // callback will be called when endpoint receives data from host
    void register_recv_callback(
    void        (*callback)(const uint8_t,
                            void*         ),
    uint8_t       endpoint                 ,   // not checked
    void         *user_data                 )
    {
        _recv_callbacks[endpoint]._callback  = callback ;
        _recv_callbacks[endpoint]._user_data = user_data;
        if (_recv_readys & (1 << endpoint))
            callback(endpoint, user_data);
    }

    // callback will be if called endpoint is ready to send data to host
    void register_send_callback(
    void        (*callback)(const uint8_t,
                            void*         ),
    uint8_t       endpoint                 ,   // not checked
    void         *user_data                 )
    {
        _send_callbacks[endpoint]._callback  = callback ;
        _send_callbacks[endpoint]._user_data = user_data;
        if (_send_readys & (1 << endpoint))
            callback(endpoint, user_data);
    }
#endif


    // accessor for information parsed from USB endpoint descriptor
    uint16_t endpoint_recv_bufsize(
    const uint8_t   endpoint)
    const {
        return _endpoints[_epaddr2eprn[endpoint]].max_recv_packet;
    }

    // accessor for information parsed from USB endpoint descriptor
    uint16_t endpoint_send_bufsize(
    const uint8_t   endpoint)
    const {
        return _endpoints[_epaddr2eprn[endpoint]].max_send_packet;
    }


    // Accessors for endpoint states
    //
    // must be volatile for #ifdef USB_DEV_INTERRUPT_DRIVEN
    uint16_t    recv_readys() const volatile { return _recv_readys; }
    uint16_t    send_readys() const volatile { return _send_readys; }

    // must be volatile for #ifdef USB_DEV_INTERRUPT_DRIVEN
    bool    recv_ready(const uint16_t   endpoints) const volatile
            { return _recv_readys & endpoints; }
    bool    send_ready(const uint16_t   endpoints) const volatile
            { return _send_readys & endpoints; }


    // Endpoint data transfers
    //
    //
    // STM32F10xx USB data is arranged internally in memory according to the
    // following layout:
    //
    // A USB data packet containing N bytes:
    //    b0, b1, b2, b3, b4, ... bN-1
    //
    // is arranged in STM32F10xx USB starting at "addr" as:
    //    addr      b0 b1 xx xx
    //    addr+4    b2 b3 xx xx
    //    addr+8    b4 b5 xx xx
    //    ...       .. .. .. ..
    // (where "xx" are unused/"don't care" values).
    //
    // As a consequence, data must be written to USB memory using the following
    // (or equivalent) methods:
    //    uint8_t    data    = {b0, b1, b2, b3, b4};
    //    uint16_t*  source  = reinterpret_cast<uint16_t*>(data + 2);
    //    uint32_t*  address = base_address + 4;
    //    *address = *data;
    // and similar for reading data from USB memory. See writ_pma_data() and
    // read_pma_data() in the usb_dev.cxx implementation file for examples
    // using both CPU and DMA.
    //
    // UsbDev's send(uint8_t, const uint8_t* const, const uint16_t)
    // and recv(uint8_t, uint8_t* const) methods, along with
    // read(const uint8_t, const uint8_t) and
    // writ(const uint8_t, const uint16_t, const uint8_t)
    // handle this correctly. Note that the data_ndx argument to both read()
    // and writ() must be specified in terms of uint16_t offsets, i.e. the
    // above example could be done via:
    //    uint16_t  data = (b2 << 8) | b3;   // little-endian
    //    usb_dev.writ(endpoint, data, 1);   // address known from endpoint
    //
    // If using raw buffer addresses obtained via send_buf() and recv_buf(),
    // client code must do the above correctly. All of these UsbDev methods,
    // with the exception of the the send() and recv() versions which take
    // uint8_t* arguments, are intended for client applications which wish
    // to avoid data copying by writing into, or reading data from, the above
    // internal memory layout. A particular use case would be DMA directly
    // from or to another hardware peripheral, such as USART for a
    // canonical USB CDC-ACM class USB-to-serial bridge. See the writ_pma_data()
    // and read_pma_data() implementations for DMA setup requirements.
    //
    // If not using send() and recv() versions which copy client data,
    // the USB_DEV_NO_BUFFER_RECV_SEND pre-processor macro can be defined
    // to eliminate their compilation and reduce binary code size.
    //

#ifndef USB_DEV_NO_BUFFER_RECV_SEND
    // no checking of params -- caller must guarantee valid
    //   endpoint and buffer
    uint16_t recv(const uint8_t         endpoint,
                        uint8_t* const  buffer  );

    // no checking of params -- caller must guarantee valid
    //   endpoint_number, data, and length
    bool send(const uint8_t         endpoint,
              const uint8_t* const  data    ,
              const uint16_t        length  );

    // TJT added 11-7-2023
    void writ_pma_one (uint8_t cc,
	    uint32_t *addr );

    void putc ( const uint8_t         endpoint,
		const uint8_t		cc );
#endif

    // for use with direct access to hardware USB buffers, below
    //
    uint16_t recv_lnth(
    const uint8_t   endpoint)   // no check for valid endpoint
    {
        if (!(_recv_readys & (1 << endpoint)))
            return 0;

        return  _pma_descs
               .eprn(_epaddr2eprn[endpoint])
               .count_rx.shifted(  stm32f103xb
                                 ::UsbBufDesc
                                 ::CountRx
                                 ::COUNT_0_SHFT)          ;
    }

