trebisky/stm32f103/usb_papoon2/papoon/usb_dev.h
    bool recv_done(
    const uint8_t   endpoint)   // no check for valid endpoint
    {
        if (!(_recv_readys & (1 << endpoint)))
            return false;

        _recv_readys &= ~(1 << endpoint);

          stm32f103xb
        ::usb
        ->eprn(_epaddr2eprn[endpoint])
         .stat_rx(stm32f103xb::Usb::Epr::STAT_RX_VALID);

        return true;
    }

    bool send(  // no check for valid endpoint or length
    const uint8_t   endpoint,
    const uint16_t  length  )
    {
        if (!(_send_readys & (1 << endpoint)))
            return false;

          _pma_descs.eprn(_epaddr2eprn[endpoint]).count_tx
        = stm32f103xb::UsbBufDesc::CountTx::count_0(length);

          stm32f103xb
        ::usb
        ->eprn(_epaddr2eprn[endpoint])
         .stat_tx(stm32f103xb::Usb::Epr::STAT_TX_VALID);

        _send_readys &= ~(1 << endpoint);

        return true;
    }

    // direct access to hardware USB buffers
    //
    uint16_t read(              // no checking of parameters
    const uint8_t   endpoint,
    const uint8_t   data_ndx)   // uint16_t index, i.e. byte index divided by 2
    {
        return *(_endpoints[_epaddr2eprn[endpoint]].recv_pma + data_ndx);
    }

    void writ(                  // no checking of parameters
    const uint8_t   endpoint,
    const uint16_t  data    ,
    const uint8_t   data_ndx)   // uint16_t index, i.e. byte index divided by 2
    {
        *(_endpoints[_epaddr2eprn[endpoint]].send_pma + data_ndx) = data;
    }

    // e.g. for DMA from/to peripheral
    //
    volatile uint32_t* recv_buf(
    const uint8_t   endpoint)
    {
        return _endpoints[_epaddr2eprn[endpoint]].recv_pma;
    }

    volatile uint32_t* send_buf(
    const uint8_t   endpoint)
    {
        return _endpoints[_epaddr2eprn[endpoint]].send_pma;
    }


  protected:

    // Information parsed from USB endpoint descriptors contained inside
    // configuration descriptor(s). Must be saved for subsequent execution
    // of reset() via USB request from host.
    struct Endpoint {
        uint32_t        *recv_pma       , // buffer, CPU addressing
                        *send_pma       ; //   "   ,  "      "
        uint16_t         max_recv_packet, // maximum USB tranfer size
                         max_send_packet; //    "     "     "      "
        DescriptorType   type          ;  // convert to Usb::Epr::mskd_t with
                                          // _DESC_EP_TYPE_TO_EPR_EP_TYPE[]
    };


    // for handling multiple transfers to host via USB control endpoint pipe
    template <typename CONST_OR_NON> class DataInfo {
      public:
        constexpr
        DataInfo()
        :   _buffer(0),
            _length(0),
            _offset(0),
            _maxpkt(0)
        {}

        void    maxpkt(uint16_t size) { _maxpkt = size; }

        void set(
        CONST_OR_NON const  buffer,
        const uint16_t      length)
        {
            _buffer = buffer;
            _length = length;
            _offset = 0     ;
        }

        uint16_t remaining_size() const { return _length - _offset; }

        uint16_t transfer_size()
        const
        {
            return remaining_size() > _maxpkt ? _maxpkt : remaining_size();
        }

        CONST_OR_NON remaining_data() const { return _buffer + _offset; }

        void update(const uint16_t  xferred) { _offset += xferred; }

        void reset() { _offset = _length = 0; }

      protected:
        CONST_OR_NON    _buffer;
        uint16_t        _length,
                        _offset,
                        _maxpkt;
    };



    // To respond to host query.
    // Derived class can modify _status member variable.
    struct Status {
        constexpr Status() : status_type(0) {}

        struct StatusType {
            using pos_t = regbits::Pos<uint8_t, StatusType>;
            static constexpr pos_t   SELF_POWERED_POS = pos_t(0),
                                    REMOTE_WAKEUP_POS = pos_t(1);

            using bits_t = regbits::Bits<uint8_t, StatusType>;
            static constexpr bits_t
                    SELF_POWERED  = bits_t(1,  SELF_POWERED_POS),
                    REMOTE_WAKEUP = bits_t(1, REMOTE_WAKEUP_POS);
        };  // struct StatusType
        using status_type_t = regbits::Reg<uint16_t, StatusType>;
              status_type_t   status_type;
    };  // struct Status


    // Information sent in requests from host during USB enumation (and after).
    // Available to MCU at fixed/configurable address in peripheral
    //   PMA buffer memory
    struct SetupPacket {
        struct RequestType {
            using pos_t = regbits::Pos<uint8_t, RequestType>;
            static constexpr pos_t        DIR_POS = pos_t(7),
                                         TYPE_POS = pos_t(5),
                                    RECIPIENT_POS = pos_t(0);
            using bits_t = regbits::Bits<uint8_t, RequestType>;
            static constexpr bits_t     DIR_DEV_TO_HOST = bits_t(1, DIR_POS);

            static const uint8_t         TYPE_MASK =    0b11,
                                    RECIPIENT_MASK = 0b11111;


            using mskd_t = regbits::Mskd<uint8_t, RequestType>;
            static constexpr mskd_t
            TYPE_STANDARD       = mskd_t(     TYPE_MASK, 0,      TYPE_POS),
            TYPE_CLASS          = mskd_t(     TYPE_MASK, 1,      TYPE_POS),
            TYPE_VENDOR         = mskd_t(     TYPE_MASK, 2,      TYPE_POS),
            RECIPIENT_DEVICE    = mskd_t(RECIPIENT_MASK, 0, RECIPIENT_POS),
            RECIPIENT_INTERFACE = mskd_t(RECIPIENT_MASK, 1, RECIPIENT_POS),
            RECIPIENT_ENDPOINT  = mskd_t(RECIPIENT_MASK, 2, RECIPIENT_POS),
            RECIPIENT_OTHER     = mskd_t(RECIPIENT_MASK, 3, RECIPIENT_POS);
        };  // struct RequestType
        using request_type_t = regbits::Reg<uint8_t, RequestType>;
              request_type_t   request_type;

        enum class Request {
            GET_STATUS        =  0,
            CLR_FEATURE       =  1,
            _RESERVED_2       =  2,
            SET_FEATURE       =  3,
            _RESERVED_4       =  4,
            SET_ADDRESS       =  5,
            GET_DESCRIPTOR    =  6,
            SET_DESCRIPTOR    =  7,
            GET_CONFIGURATION =  8,
            SET_CONFIGURATION =  9,
            GET_INTERFACE     = 10,
            SET_INTERFACE     = 11,
            SYNCH_FRAME       = 12,
        };

