trebisky/stm32f103/usb_papoon2/papoon/usb_dev.h
        uint8_t     request;

        uint16_t    _alignment_0;
        union {
            uint16_t                    word;
            struct {
                uint8_t     byte0;   // is byte-reversed
                uint8_t     byte1;   // "   "      "
            }                           bytes;
        } value;

        uint16_t    _alignment_1,
                    index,
                    _alignment_2,
                    length,
                    _alignment_3;
    };  // struct SetupPacket


#ifdef USB_DEV_ENDPOINT_CALLBACKS
    struct EndpointCallback {
        void    (*_callback)(const uint8_t,
                             void*        );
        void     *_user_data               ;
    };
#endif


    static const uint32_t   _BTABLE_OFFSET = 0;

    /* 11-17-2023 tjt changed SERIAL ..LEN from 24 to 4
                            _SERIAL_NUMBER_STRING_NDX        =  3,
                            _SERIAL_NUMBER_STRING_LEN        = 24,
     */
    static const uint8_t    _DESCRIPTOR_SIZE_NDX             =  0,
                            _DEVICE_DESC_MAX_PACKET_SIZE_NDX =  7,
                            _DEVICE_DESC_NUM_CONFIGS_NDX     = 17,
                            _SERIAL_NUMBER_STRING_LEN        =  4,
                            _ENDPOINT_DESC_ADDRESS_NDX       =  2,
                            _ENDPOINT_DESC_ATTRIBUTES_NDX    =  3,
                            _ENDPOINT_DESC_PACKET_SIZE_NDX   =  4;

    static const uint8_t    _ENDPOINT_ATTRS_TYPE_MASK = 0x0f;

    static const uint8_t    IMPOSSIBLE_DEV_ADDR = 0xff;


    // mapping from USB descriptor bDescriptorType (at CONFIG_DESC_SIZE_NDX
    // offset in descriptor) to Usb::Epr::EP_TYPE_XXX
    static const stm32f103xb::Usb::Epr::mskd_t  _DESC_EP_TYPE_TO_EPR_EP_TYPE[];

    // derived class implements _DEVICE_DESC, _CONFIG_DESC, and _STRING_DESCS
    // _CONFIG_DESC parsed in init() -- minimal checking done, malformed
    //   descriptor (bad bLength fields, duplicate or 0==control
    //   bEndpointAddress values, etc) will cause HardFault exception or
    //   inoperative USB peripheral. (Note *can* have bEndpointAddress of
    //   0x8n and 0x0n -- IN and OUT endpoints with same numeric address.)
    static const uint8_t    _DEVICE_DESC              [],
                            _LANGUAGE_ID_STRING_DESC  [],
                            _VENDOR_STRING_DESC       [];
                            // must be non-const because runtime setting of ...
    static       uint8_t    _CONFIG_DESC              [],  // ... bLength field
                            _SERIAL_NUMBER_STRING_DESC[];  // ... all bytes
    static const uint8_t*   _STRING_DESCS[];

    void    reset(),
            ctr  ();

    void    setup          (),
            control_out    (),
            control_in     (),
            data_stage_in  ();

    bool    standard_request  (),
            device_request    (),
            interface_request (),
            endpoint_request  (),
            descriptor_request();

    bool    device_class_setup();  // derived class must provide
    void    set_configuration ();  //    "      "    "      "
    void    set_interface     ();  //    "      "    "      "

    void    set_address(const uint8_t   address);

    void    writ_pma_data(const uint8_t*  const     data,
                                uint32_t* const     addr,
                          const uint16_t            size),
            read_pma_data(      uint8_t*  const     data,
                          const uint32_t* const     addr,
                          const uint16_t            size);


    // fake endpoint count of 1 okay, only using  statically-checked EPRN<0>()
    stm32f103xb ::UsbPmaDescs<1, _BTABLE_OFFSET>    _pma_descs;

    // indexed by ST endpoint register (Usb::Epr, UsbBufDesc, UsbPmaDescs)
    Endpoint                    _endpoints     [  stm32f103xb
                                                ::Usb
                                                ::NUM_ENDPOINT_REGS];

#ifdef USB_DEV_ENDPOINT_CALLBACKS
      EndpointCallback          _recv_callbacks[  stm32f103xb
                                                ::Usb
                                                ::NUM_ENDPOINT_REGS],
                                _send_callbacks[  stm32f103xb
                                                ::Usb
                                                ::NUM_ENDPOINT_REGS];
#endif

      // mappings between endpoint address as per USB descriptor
      // and ST peripheral endpoint registers (Usb::Epr) and
      // pseudo-registers (UsbPmaDescs/UsbBufDesc in PMA memory)
      //
                                // USB endpoint descriptor numbers and ST regs'
                                // Istr::EP_ID and Epr::EA fields are 4 bits wide
      uint8_t                   _epaddr2eprn   [ENDPOINT_ADDR_MASK + 1];

                                // must be saved -- can't rely on on
                                // Usb::eprn[n].EA field because gets cleared
                                // on extra USB reset during enumeration
      uint8_t                   _eprn2epaddr   [  stm32f103xb
                                                ::Usb
                                                ::NUM_ENDPOINT_REGS   ];

      DataInfo<const uint8_t*>  _send_info            ;
      DataInfo<      uint8_t*>  _recv_info            ;
      SetupPacket*              _setup_packet         ;
      DeviceState               _device_state         ;
      Status                    _status               ;

                                // bit N indicates USB endpoint descriptor addr
      uint16_t                  _recv_readys          ,
                                _send_readys          ,
                                _send_readys_pending  ;

      uint16_t                  _last_send_size       ;
      uint8_t                   _num_eprns            ,
                                _current_configuration,
                                _current_interface    ,
                                _pending_set_addr     ;
};  // class UsbDev

} // namespace stm32f10_12357_xx

#endif  // ifndef USB_DEV_HXX
